## ğŸ“‚ DataFrame

DataFrameì´ë€ **í–‰ê³¼ ì—´ë¡œ ë§Œë“¤ì–´ì§€ëŠ” ì¸ë±ì‹±ëœ 2ì°¨ì› ë°°ì—´**ì´ë‹¤.<br>
Pandas ë¼ì´ë¸ŒëŸ¬ë¦¬ì—ì„œ ê¸°ë³¸ì ìœ¼ë¡œ ë°ì´í„°ë¥¼ ë‹¤ë£¨ëŠ” ë‹¨ìœ„ì´ë©° DataFrameì˜ ê° ì—´ì€ Seriesë¡œ êµ¬ì„±ë˜ì–´ ìˆë‹¤.<br>
DataFrameì˜ ì„¸ë¡œ ì¶• ë¼ë²¨(í–‰)ì„ **Index**, ê°€ë¡œ ì¶• ë¼ë²¨(ì—´)ì„ **Column**, Indexì™€ Columnì„ ì œì™¸í•œ ë°ì´í„° ë¶€ë¶„ì„ **Value**ë¼ê³  í•œë‹¤.

---

## ğŸ“‚ DataFrame ìƒì„±

DataFrameì„ ì´ìš©í•´ ë°ì´í„°ë¥¼ ìƒì„±í•˜ëŠ” ë°©ë²•ì€ ë‹¤ìŒê³¼ ê°™ë‹¤.

**df = pd.DataFrame(data [, index=index_data, columns=columns_data])**

dataì—ëŠ” ë¦¬ìŠ¤íŠ¸, ë”•ì…”ë„ˆë¦¬, Series ë“±ì„ ì…ë ¥í•  ìˆ˜ ìˆë‹¤.<br>
indexì™€ columnsì—ëŠ” 1ì°¨ì› ë°°ì—´ê³¼ ìœ ì‚¬í•œ ë°ì´í„°íƒ€ì…(ë¦¬ìŠ¤íŠ¸, Series ë“±)ì˜ ë°ì´í„°ë¥¼ ì…ë ¥í•  ìˆ˜ ìˆë‹¤.<br>
Seriesì™€ ë§ˆì°¬ê°€ì§€ë¡œ ìƒëµí•œë‹¤ë©´ ë¼ë²¨ì´ 0ë¶€í„° ìë™ìœ¼ë¡œ ë¶€ì—¬ëœë‹¤.

ë¦¬ìŠ¤íŠ¸ë¡œ DataFrameì„ ìƒì„±í•  ê²½ìš° ê° ë¦¬ìŠ¤íŠ¸ëŠ” í•˜ë‚˜ì˜ í–‰ìœ¼ë¡œ êµ¬ì„±ëœë‹¤.<br>
í–‰ì˜ ì›ì†Œ ê°œìˆ˜ê°€ ë‹¤ë¥´ë©´ None ê°’ìœ¼ë¡œ ì €ì¥ëœë‹¤.<br>
ì•„ë˜ëŠ” ë¦¬ìŠ¤íŠ¸ë¥¼ ì´ìš©í•´ DataFrameì˜ ë°ì´í„°ë¥¼ ìƒì„±í•œ ì˜ˆì œì´ë‹¤.

In [1]:
import numpy as np
import pandas as pd

In [2]:
pd.DataFrame([['a', 'b', 'c'],
              ['a', 'a', 'g'],
              ['a', 'a']])

   0  1     2
0  a  b     c
1  a  a     g
2  a  a  None

ë”•ì…”ë„ˆë¦¬ë¡œë„ DataFrame ìƒì„±í•  ê²½ìš° ë”•ì…”ë„ˆë¦¬ì˜ KeyëŠ” DataFrameì˜ ì»¬ëŸ¼ëª…ì´ ëœë‹¤.<br>
ì—´ ë°ì´í„°ë¥¼ ë”•ì…”ë„ˆë¦¬ë¡œ ì‘ì„±í•˜ëŠ” ê²ƒì´ ì¼ë°˜ì ì´ë‹¤.

In [3]:
pd.DataFrame({
    'A':[90, 80, 70],  # Column 1 Name
    'B':[85, 98, 75],  # Column 2 Name
    'C':[88, 99, 77],  # Column 3 Name   
    'D':[87, 89, 86]   # Column 4 Name
}, index=[1, 2, 3])    # Row Name

    A   B   C   D
1  90  85  88  87
2  80  98  99  89
3  70  75  77  86

In [4]:
data = {
    '2015': [9904312, 3448737, 2890451, 2466052],
    '2010': [9631482, 3393191, 2632035, 2000002],
    '2005': [9762546, 3512547, 2517680, 2456016],
    '2000': [9853972, 3655437, 2466338, 2473990],
    'ì§€ì—­': ['ìˆ˜ë„ê¶Œ', 'ê²½ìƒê¶Œ', 'ìˆ˜ë„ê¶Œ', 'ê²½ìƒê¶Œ'],
    '2010-2015 ì¦ê°€ìœ¨': [0.0283, 0.0163, 0.0982,0.0141]
}

df1 = pd.DataFrame(data)
df1

      2015     2010     2005     2000   ì§€ì—­  2010-2015 ì¦ê°€ìœ¨
0  9904312  9631482  9762546  9853972  ìˆ˜ë„ê¶Œ         0.0283
1  3448737  3393191  3512547  3655437  ê²½ìƒê¶Œ         0.0163
2  2890451  2632035  2517680  2466338  ìˆ˜ë„ê¶Œ         0.0982
3  2466052  2000002  2456016  2473990  ê²½ìƒê¶Œ         0.0141

ìœ„ì—ì„œ ìƒì„±ëœ DataFrameì€ Columnì˜ ìˆœì„œê°€ ë³´ì¥ë˜ì§€ ì•Šê³  ê° í–‰ì˜ ì˜ë¯¸ ì „ë‹¬ì´ ì–´ë µë‹¤.<br>
Index íŒŒë¼ë¯¸í„°ì™€ Columns íŒŒë¼ë¯¸í„°ë¥¼ ì´ìš©í•´ DataFrameì˜ ì˜ë¯¸ ì „ë‹¬ì„ ìˆ˜ì›”í•˜ê²Œ í•  ìˆ˜ ìˆë‹¤.

In [5]:
columns = ['ì§€ì—­', '2000', '2005', '2010', '2015', '2010-2015 ì¦ê°€ìœ¨']
index = ['ì„œìš¸', 'ë¶€ì‚°', 'ì¸ì²œ', 'ëŒ€êµ¬']
df1 = pd.DataFrame(data, index=index, columns=columns)
df1

     ì§€ì—­     2000     2005     2010     2015  2010-2015 ì¦ê°€ìœ¨
ì„œìš¸  ìˆ˜ë„ê¶Œ  9853972  9762546  9631482  9904312         0.0283
ë¶€ì‚°  ê²½ìƒê¶Œ  3655437  3512547  3393191  3448737         0.0163
ì¸ì²œ  ìˆ˜ë„ê¶Œ  2466338  2517680  2632035  2890451         0.0982
ëŒ€êµ¬  ê²½ìƒê¶Œ  2473990  2456016  2000002  2466052         0.0141

Seriesë¡œ DataFrame ìƒì„± í•˜ëŠ” ê²½ìš° ê° Seriesì˜ ì¸ë±ìŠ¤ëŠ” ì»¬ëŸ¼ëª…ì´ ëœë‹¤.

In [6]:
x = pd.Series([100, 200, 300], ['a', 'b', 'c'])
y = pd.Series([101, 201, 301], ['a', 'b', 'c'])
z = pd.Series([110, 210, 310], ['a', 'b', 'd'])

pd.DataFrame([x, y, z], index=[100, 101, 102])

         a      b      c      d
100  100.0  200.0  300.0    NaN
101  101.0  201.0  301.0    NaN
102  110.0  210.0    NaN  310.0

CSV(Comma Seperated Values) ë°ì´í„° íŒŒì¼ì„ ì´ìš©í•´ DataFrame ìƒì„±ì´ ê°€ëŠ¥í•˜ë‹¤.<br>
ì´ëŠ” ë°ì´í„° ë¶„ì„ì„ ìœ„í•´ DataFrameì„ ìƒì„±í•˜ëŠ” ê°€ì¥ ì¼ë°˜ì ì¸ ë°©ë²•ì´ë‹¤.<br>
CSV íŒŒì¼ì€ **pd.read_csv()** í•¨ìˆ˜ë¥¼ ì‚¬ìš©í•´ ë¶ˆëŸ¬ì˜¬ ìˆ˜ ìˆë‹¤.

In [7]:
train_data = pd.read_csv('./data/train.csv')
train_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

read_csv()í•¨ìˆ˜ì˜ íŒŒë¼ë¯¸í„°ëŠ” ë‹¤ìŒê³¼ ê°™ë‹¤.
- sep : ê° ë°ì´í„° ê°’ì„ êµ¬ë³„í•˜ê¸° ìœ„í•œ êµ¬ë¶„ì(Separator) ì„¤ì • 
- header : headerë¥¼ ë¬´ì‹œí•  ê²½ìš° None ì„¤ì •
- index_col : indexë¡œ ì‚¬ìš©í•  ì—´ ì„¤ì •
- usecols : ì‹¤ì œë¡œ DataFrameì— ë¡œë”©í•  ì—´ë§Œ ì„¤ì •

In [8]:
train_data = pd.read_csv('./data/train.csv',
                         index_col='PassengerId',
                         usecols=['PassengerId', 'Survived', 'Name', 'Sex', 'Age'])

In [9]:
train_data.columns

Index(['Survived', 'Name', 'Sex', 'Age'], dtype='object')

In [10]:
train_data.head()

,Survived,Name,Sex,Age
PassengerId,,,,
1,0,"Braund, Mr. Owen Harris",male,22.0
2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0
3,1,"Heikkinen, Miss. Laina",female,26.0
4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0
5,0,"Allen, Mr. William Henry",male,35.0

---

## ğŸ“‚ DataFrame Index Â· Columns

Index ì†ì„±ì€ ê° ì•„ì´í…œì„ íŠ¹ì •í•  ìˆ˜ ìˆëŠ” ê³ ìœ ì˜ ê°’ì„ ì €ì¥í•œë‹¤.<br>
ë³µì¡í•œ ë°ì´í„°ì˜ ê²½ìš°ì—ëŠ” ë©€í‹° ì¸ë±ìŠ¤ë¡œ í‘œí˜„ í•  ìˆ˜ ìˆë‹¤.

Columns ì†ì„±ì€ ê°ê°ì˜ íŠ¹ì„±(Feature)ë¥¼ ë‚˜íƒ€ë‚¸ë‹¤.<br>
ë³µì¡í•œ ë°ì´í„°ì˜ ê²½ìš°ì—ëŠ” ë©€í‹° ì»¬ëŸ¼ìœ¼ë¡œ í‘œí˜„ í•  ìˆ˜ ìˆë‹¤.

In [11]:
df1

     ì§€ì—­     2000     2005     2010     2015  2010-2015 ì¦ê°€ìœ¨
ì„œìš¸  ìˆ˜ë„ê¶Œ  9853972  9762546  9631482  9904312         0.0283
ë¶€ì‚°  ê²½ìƒê¶Œ  3655437  3512547  3393191  3448737         0.0163
ì¸ì²œ  ìˆ˜ë„ê¶Œ  2466338  2517680  2632035  2890451         0.0982
ëŒ€êµ¬  ê²½ìƒê¶Œ  2473990  2456016  2000002  2466052         0.0141

In [12]:
df1.index

Index(['ì„œìš¸', 'ë¶€ì‚°', 'ì¸ì²œ', 'ëŒ€êµ¬'], dtype='object')

In [13]:
df1.columns

Index(['ì§€ì—­', '2000', '2005', '2010', '2015', '2010-2015 ì¦ê°€ìœ¨'], dtype='object')

Indexì™€ Columnsì— ê°ê° ì´ë¦„ì„ ë¶€ì—¬í•  ìˆ˜ë„ ìˆë‹¤.<br>
Indexì—ëŠ” 'df.index.name'ìœ¼ë¡œ Columnsì—ëŠ” 'df.columns.name'ìœ¼ë¡œ ë„¤ì´ë° í•  ìˆ˜ ìˆë‹¤.

In [14]:
df1.index.name = 'ë„ì‹œ'
df1.columns.name = 'íŠ¹ì„±'

In [15]:
df1

íŠ¹ì„±   ì§€ì—­     2000     2005     2010     2015  2010-2015 ì¦ê°€ìœ¨
ë„ì‹œ
ì„œìš¸  ìˆ˜ë„ê¶Œ  9853972  9762546  9631482  9904312         0.0283
ë¶€ì‚°  ê²½ìƒê¶Œ  3655437  3512547  3393191  3448737         0.0163
ì¸ì²œ  ìˆ˜ë„ê¶Œ  2466338  2517680  2632035  2890451         0.0982
ëŒ€êµ¬  ê²½ìƒê¶Œ  2473990  2456016  2000002  2466052         0.0141

---

## ğŸ“‚ DataFrame ë°ì´í„° íŒŒì•…

In [16]:
train_data.head()

,Survived,Name,Sex,Age
PassengerId,,,,
1,0,"Braund, Mr. Owen Harris",male,22.0
2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0
3,1,"Heikkinen, Miss. Laina",female,26.0
4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0
5,0,"Allen, Mr. William Henry",male,35.0

shapeëŠ” DataFrameë¥¼ íŠœí”Œ í˜•íƒœì˜ shapeë¡œ ë°˜í™˜í•œë‹¤.

In [17]:
train_data.shape

(891, 4)

describe()ëŠ” DataFrameì— ëŒ€í•œ ìˆ«ìí˜• ë°ì´í„°ì˜ í†µê³„ì¹˜ë¥¼ ê³„ì‚°í•œë‹¤.

In [18]:
train_data.describe() # ìˆ˜ì¹˜í˜• ë°ì´í„°ì— ëŒ€í•´ì„œë§Œ í†µê³„ì¹˜ë¥¼ ê³„ì‚°

         Survived         Age
count  891.000000  714.000000
mean     0.383838   29.699118
std      0.486592   14.526497
min      0.000000    0.420000
25%      0.000000   20.125000
50%      0.000000   28.000000
75%      1.000000   38.000000
max      1.000000   80.000000

info()ëŠ” ë°ì´í„° íƒ€ì…, ê° ì•„ì´í…œì˜ ê°œìˆ˜ ë“± DataFrameì˜ ì „ë°˜ì ì¸ ì •ë³´ë¥¼ ì¶œë ¥í•œë‹¤.

In [19]:
train_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Name      891 non-null    object
 2   Sex       891 non-null    object
 3   Age       714 non-null    float64
dtypes: float64(1), int64(1), object(2)
memory usage: 34.8+ KB

---

## ğŸ“‚ DataFrame ì „ì¹˜

ì „ì¹˜ë€ í–‰ê³¼ ì—´ì„ ë°”ê¾¸ëŠ” ê¸°ëŠ¥ì´ë‹¤.

In [20]:
df1

íŠ¹ì„±   ì§€ì—­     2000     2005     2010     2015  2010-2015 ì¦ê°€ìœ¨
ë„ì‹œ
ì„œìš¸  ìˆ˜ë„ê¶Œ  9853972  9762546  9631482  9904312         0.0283
ë¶€ì‚°  ê²½ìƒê¶Œ  3655437  3512547  3393191  3448737         0.0163
ì¸ì²œ  ìˆ˜ë„ê¶Œ  2466338  2517680  2632035  2890451         0.0982
ëŒ€êµ¬  ê²½ìƒê¶Œ  2473990  2456016  2000002  2466052         0.0141

In [21]:
df1.T

ë„ì‹œ                  ì„œìš¸       ë¶€ì‚°       ì¸ì²œ       ëŒ€êµ¬
íŠ¹ì„±
ì§€ì—­                 ìˆ˜ë„ê¶Œ      ê²½ìƒê¶Œ      ìˆ˜ë„ê¶Œ      ê²½ìƒê¶Œ
2000           9853972  3655437  2466338  2473990
2005           9762546  3512547  2517680  2456016
2010           9631482  3393191  2632035  2000002
2015           9904312  3448737  2890451  2466052
2010-2015 ì¦ê°€ìœ¨   0.0283   0.0163   0.0982   0.0141

---

## ğŸ“‚ DataFrame ì¸ë±ì‹±

DataFrame ì¸ë±ì‹±ì€ ì¸ë±ì„œë¥¼ ì‚¬ìš©í•˜ëŠ” ë°©ë²•ì„ ì œì™¸í•˜ë©´ ì—´ ì¸ë±ì‹±, ì¸ë±ì„œë¥¼ ì‚¬ìš©í•˜ì§€ ì•ŠëŠ” í–‰ ì¸ë±ì‹± 2ê°€ì§€ ë°©ë²•ì´ ì¡´ì¬í•œë‹¤.

In [22]:
df1

íŠ¹ì„±   ì§€ì—­     2000     2005     2010     2015  2010-2015 ì¦ê°€ìœ¨
ë„ì‹œ
ì„œìš¸  ìˆ˜ë„ê¶Œ  9853972  9762546  9631482  9904312         0.0283
ë¶€ì‚°  ê²½ìƒê¶Œ  3655437  3512547  3393191  3448737         0.0163
ì¸ì²œ  ìˆ˜ë„ê¶Œ  2466338  2517680  2632035  2890451         0.0982
ëŒ€êµ¬  ê²½ìƒê¶Œ  2473990  2456016  2000002  2466052         0.0141

ê°€ì¥ ê¸°ë³¸ì ì¸ ì—´ ì¸ë±ì‹±ì€ ì»¬ëŸ¼ëª…ì„ í•˜ë‚˜ ë„£ëŠ” ê²ƒì´ë‹¤.<br>
í•´ë‹¹í•˜ëŠ” ì»¬ëŸ¼ëª…ì´ ê°€ì§€ê³  ìˆëŠ” ë°ì´í„°ë“¤ì´ ì¸ë±ìŠ¤ëª…ê³¼ í•¨ê»˜ Seriesê°€ ë°˜í™˜ëœë‹¤.

In [23]:
df1['ì§€ì—­']

ë„ì‹œ
ì„œìš¸    ìˆ˜ë„ê¶Œ
ë¶€ì‚°    ê²½ìƒê¶Œ
ì¸ì²œ    ìˆ˜ë„ê¶Œ
ëŒ€êµ¬    ê²½ìƒê¶Œ
Name: ì§€ì—­, dtype: object

ì»¬ëŸ¼ 1ê°œë¥¼ ì¶”ì¶œí•  ì‹œì—ëŠ” '.' ì—°ì‚°ìë¥¼ ì‚¬ìš©í•˜ëŠ” ë°©ë²•ë„ ìˆë‹¤.

In [24]:
df1.ì§€ì—­

ë„ì‹œ
ì„œìš¸    ìˆ˜ë„ê¶Œ
ë¶€ì‚°    ê²½ìƒê¶Œ
ì¸ì²œ    ìˆ˜ë„ê¶Œ
ëŒ€êµ¬    ê²½ìƒê¶Œ
Name: ì§€ì—­, dtype: object

ì»¬ëŸ¼ì„ 1ê°œ ì´ìƒ ì„ íƒí•˜ê³ ì í•  ë•Œì—ëŠ” ë¦¬ìŠ¤íŠ¸ë¥¼ ì‚¬ìš©í•œë‹¤.<br>
ë¦¬ìŠ¤íŠ¸ë¥¼ ì‚¬ìš©í•˜ë©´ ë¶€ë¶„ì  DataFrameì´ ë°˜í™˜ëœë‹¤.

In [25]:
df1[['ì§€ì—­']]

íŠ¹ì„±   ì§€ì—­
ë„ì‹œ
ì„œìš¸  ìˆ˜ë„ê¶Œ
ë¶€ì‚°  ê²½ìƒê¶Œ
ì¸ì²œ  ìˆ˜ë„ê¶Œ
ëŒ€êµ¬  ê²½ìƒê¶Œ

In [26]:
df1[['2010', '2015']]

íŠ¹ì„±     2010     2015
ë„ì‹œ
ì„œìš¸  9631482  9904312
ë¶€ì‚°  3393191  3448737
ì¸ì²œ  2632035  2890451
ëŒ€êµ¬  2000002  2466052

DataFrameì˜ ì»¬ëŸ¼ëª…ì´ ë¬¸ìì—´ì¼ ê²½ìš°ì—ëŠ” ì •ìˆ˜í˜• ìœ„ì¹˜ ì¸ë±ì‹± ê¸°ëŠ¥ì„ ì‚¬ìš©í•  ìˆ˜ ì—†ë‹¤.

In [27]:
try :
    df1[0]
except Exception as e :
    print(type(e))

<class 'KeyError'>

ì•„ë˜ëŠ” ìœ„ì¹˜ ì¸ë±ì‹±ì²˜ëŸ¼ ë³´ì´ëŠ” ì˜ˆì œì´ë‹¤.

In [28]:
df2 = pd.DataFrame(np.arange(12).reshape(3, 4)) 
df2

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

ì•„ë˜ì˜ ì¸ë±ì‹±ì€ ìœ„ì¹˜ ì¸ë±ì‹±ì´ ì•„ë‹ˆë¼ ì»¬ëŸ¼ëª…ì´ ìˆ«ìë¡œ ë˜ì–´ ìˆëŠ” ê²½ìš°ì´ë‹¤.

In [29]:
df2[[1, 2]]

   1   2
0  1   2
1  5   6
2  9  10

í–‰ ë‹¨ìœ„ ì¸ë±ì‹±ì„ í•˜ê³ ì í•œë‹¤ë©´ ì¸ë±ì„œë¼ëŠ” íŠ¹ìˆ˜ ê¸°ëŠ¥ì„ ì‚¬ìš©í•˜ì§€ ì•ŠëŠ” ê²½ìš° ìŠ¬ë¼ì´ì‹±ì„ í•´ì•¼ í•œë‹¤.

In [30]:
df1['ì„œìš¸':'ì„œìš¸']

íŠ¹ì„±   ì§€ì—­     2000     2005     2010     2015  2010-2015 ì¦ê°€ìœ¨
ë„ì‹œ
ì„œìš¸  ìˆ˜ë„ê¶Œ  9853972  9762546  9631482  9904312         0.0283

In [31]:
df1['ì¸ì²œ':'ëŒ€êµ¬']

íŠ¹ì„±   ì§€ì—­     2000     2005     2010     2015  2010-2015 ì¦ê°€ìœ¨
ë„ì‹œ
ì¸ì²œ  ìˆ˜ë„ê¶Œ  2466338  2517680  2632035  2890451         0.0982
ëŒ€êµ¬  ê²½ìƒê¶Œ  2473990  2456016  2000002  2466052         0.0141

í–‰ ë‹¨ìœ„ ì¸ë±ì‹±ì˜ ê²½ìš° ì¸ë±ìŠ¤ëª…ì´ ë¬¸ìì—´ì´ë”ë¼ë„ ì •ìˆ˜í˜• ìœ„ì¹˜ ì¸ë±ì‹± ê¸°ëŠ¥ì„ ì‚¬ìš©í•  ìˆ˜ ìˆë‹¤.

In [32]:
df1[:1]

íŠ¹ì„±   ì§€ì—­     2000     2005     2010     2015  2010-2015 ì¦ê°€ìœ¨
ë„ì‹œ
ì„œìš¸  ìˆ˜ë„ê¶Œ  9853972  9762546  9631482  9904312         0.0283

In [33]:
df1[1:3]

íŠ¹ì„±   ì§€ì—­     2000     2005     2010     2015  2010-2015 ì¦ê°€ìœ¨
ë„ì‹œ
ë¶€ì‚°  ê²½ìƒê¶Œ  3655437  3512547  3393191  3448737         0.0163
ì¸ì²œ  ìˆ˜ë„ê¶Œ  2466338  2517680  2632035  2890451         0.0982

ì—´ì„ ìš°ì„ ì ìœ¼ë¡œ ì„ íƒí•˜ê³  í–‰ì„ ì„ íƒí•´ ì›í•˜ëŠ” ë°ì´í„°ë¥¼ ììœ ë¡­ê²Œ ì„ íƒí•  ìˆ˜ ìˆë‹¤.

In [34]:
df1['ì§€ì—­']['ì„œìš¸']

'ìˆ˜ë„ê¶Œ'

In [35]:
df1['ì§€ì—­'][0]

'ìˆ˜ë„ê¶Œ'

In [36]:
df1.ì§€ì—­['ì„œìš¸']

'ìˆ˜ë„ê¶Œ'

In [37]:
df1.ì§€ì—­[0]

'ìˆ˜ë„ê¶Œ'

In [38]:
df1['ì§€ì—­']['ì„œìš¸':'ì¸ì²œ']

ë„ì‹œ
ì„œìš¸    ìˆ˜ë„ê¶Œ
ë¶€ì‚°    ê²½ìƒê¶Œ
ì¸ì²œ    ìˆ˜ë„ê¶Œ
Name: ì§€ì—­, dtype: object

In [39]:
df1['ì§€ì—­'][0:3]

ë„ì‹œ
ì„œìš¸    ìˆ˜ë„ê¶Œ
ë¶€ì‚°    ê²½ìƒê¶Œ
ì¸ì²œ    ìˆ˜ë„ê¶Œ
Name: ì§€ì—­, dtype: object

In [40]:
df1.ì§€ì—­['ì„œìš¸':'ì¸ì²œ']

ë„ì‹œ
ì„œìš¸    ìˆ˜ë„ê¶Œ
ë¶€ì‚°    ê²½ìƒê¶Œ
ì¸ì²œ    ìˆ˜ë„ê¶Œ
Name: ì§€ì—­, dtype: object

In [41]:
df1.ì§€ì—­[0:3]

ë„ì‹œ
ì„œìš¸    ìˆ˜ë„ê¶Œ
ë¶€ì‚°    ê²½ìƒê¶Œ
ì¸ì²œ    ìˆ˜ë„ê¶Œ
Name: ì§€ì—­, dtype: object

In [42]:
df1.ì§€ì—­['ì„œìš¸':'ì¸ì²œ']

ë„ì‹œ
ì„œìš¸    ìˆ˜ë„ê¶Œ
ë¶€ì‚°    ê²½ìƒê¶Œ
ì¸ì²œ    ìˆ˜ë„ê¶Œ
Name: ì§€ì—­, dtype: object

In [43]:
df1[['ì§€ì—­']][0:3]

íŠ¹ì„±   ì§€ì—­
ë„ì‹œ
ì„œìš¸  ìˆ˜ë„ê¶Œ
ë¶€ì‚°  ê²½ìƒê¶Œ
ì¸ì²œ  ìˆ˜ë„ê¶Œ

In [44]:
df1[['ì§€ì—­']]['ì„œìš¸':'ì¸ì²œ']

íŠ¹ì„±   ì§€ì—­
ë„ì‹œ
ì„œìš¸  ìˆ˜ë„ê¶Œ
ë¶€ì‚°  ê²½ìƒê¶Œ
ì¸ì²œ  ìˆ˜ë„ê¶Œ

In [45]:
df1[['2010', '2015']]['ì„œìš¸':'ì¸ì²œ']

íŠ¹ì„±     2010     2015
ë„ì‹œ
ì„œìš¸  9631482  9904312
ë¶€ì‚°  3393191  3448737
ì¸ì²œ  2632035  2890451

In [46]:
df1[['2010', '2015']][0:3]

íŠ¹ì„±     2010     2015
ë„ì‹œ
ì„œìš¸  9631482  9904312
ë¶€ì‚°  3393191  3448737
ì¸ì²œ  2632035  2890451

ì»¬ëŸ¼ì€ ìŠ¬ë¼ì´ì‹±ì„ í•  ìˆ˜ ì—†ë‹¤.

In [47]:
df1[['2000':'2010']]

SyntaxError: invalid syntax (3807169988.py, line 1)

---

## ğŸ“‚ DataFrame ê°±ì‹  Â· ì¶”ê°€ Â· ì‚­ì œ

In [48]:
df1

íŠ¹ì„±   ì§€ì—­     2000     2005     2010     2015  2010-2015 ì¦ê°€ìœ¨
ë„ì‹œ
ì„œìš¸  ìˆ˜ë„ê¶Œ  9853972  9762546  9631482  9904312         0.0283
ë¶€ì‚°  ê²½ìƒê¶Œ  3655437  3512547  3393191  3448737         0.0163
ì¸ì²œ  ìˆ˜ë„ê¶Œ  2466338  2517680  2632035  2890451         0.0982
ëŒ€êµ¬  ê²½ìƒê¶Œ  2473990  2456016  2000002  2466052         0.0141

DataFrameì— ì¡´ì¬í•˜ëŠ” ì¸ë±ìŠ¤ëª…ì— ê°’ì„ í• ë‹¹í•˜ë©´ ë°ì´í„° ê°±ì‹ ì„ í•  ìˆ˜ ìˆë‹¤.

In [49]:
df1['2010-2015 ì¦ê°€ìœ¨'] = df1['2010-2015 ì¦ê°€ìœ¨'] * 100
df1['2010-2015 ì¦ê°€ìœ¨']

ë„ì‹œ
ì„œìš¸    2.83
ë¶€ì‚°    1.63
ì¸ì²œ    9.82
ëŒ€êµ¬    1.41
Name: 2010-2015 ì¦ê°€ìœ¨, dtype: float64

DataFrameì— ì¡´ì¬í•˜ì§€ ì•ŠëŠ” ì»¬ëŸ¼ëª…ì— ê°’ì„ í• ë‹¹í•˜ë©´ ë°ì´í„° ì¶”ê°€ë¥¼ í•  ìˆ˜ ìˆë‹¤.

In [50]:
df1['ë¹„ê³ '] = ['íŠ¹ë³„ì‹œ', 'ê´‘ì—­ì‹œ', 'íŠ¹ë¡€ì‹œ', 'íŠ¹ë¡€ì‹œ']
df1

íŠ¹ì„±   ì§€ì—­     2000     2005     2010     2015  2010-2015 ì¦ê°€ìœ¨   ë¹„ê³
ë„ì‹œ
ì„œìš¸  ìˆ˜ë„ê¶Œ  9853972  9762546  9631482  9904312           2.83  íŠ¹ë³„ì‹œ
ë¶€ì‚°  ê²½ìƒê¶Œ  3655437  3512547  3393191  3448737           1.63  ê´‘ì—­ì‹œ
ì¸ì²œ  ìˆ˜ë„ê¶Œ  2466338  2517680  2632035  2890451           9.82  íŠ¹ë¡€ì‹œ
ëŒ€êµ¬  ê²½ìƒê¶Œ  2473990  2456016  2000002  2466052           1.41  íŠ¹ë¡€ì‹œ

ë‹¤ë¥¸ ë°ì´í„°ë“¤ì„ ì´ìš©í•´ ê³„ì‚°í•œ ì»¬ëŸ¼ë„ ì¶”ê°€í•  ìˆ˜ ìˆë‹¤.

In [51]:
df1['2005-2015 ì¦ê°€ìœ¨'] = ((df1['2015'] - df1['2005']) / df1['2005'] * 100).round(2)
df1

íŠ¹ì„±   ì§€ì—­     2000     2005     2010     2015  2010-2015 ì¦ê°€ìœ¨   ë¹„ê³   2005-2015 ì¦ê°€ìœ¨
ë„ì‹œ
ì„œìš¸  ìˆ˜ë„ê¶Œ  9853972  9762546  9631482  9904312           2.83  íŠ¹ë³„ì‹œ           1.45
ë¶€ì‚°  ê²½ìƒê¶Œ  3655437  3512547  3393191  3448737           1.63  ê´‘ì—­ì‹œ          -1.82
ì¸ì²œ  ìˆ˜ë„ê¶Œ  2466338  2517680  2632035  2890451           9.82  íŠ¹ë¡€ì‹œ          14.81
ëŒ€êµ¬  ê²½ìƒê¶Œ  2473990  2456016  2000002  2466052           1.41  íŠ¹ë¡€ì‹œ           0.41

delì„ ì´ìš©í•´ ë°ì´í„° ì‚­ì œë¥¼ í•  ìˆ˜ ìˆë‹¤.

In [52]:
del df1['ë¹„ê³ ']
del df1['2005-2015 ì¦ê°€ìœ¨']
df1

íŠ¹ì„±   ì§€ì—­     2000     2005     2010     2015  2010-2015 ì¦ê°€ìœ¨
ë„ì‹œ
ì„œìš¸  ìˆ˜ë„ê¶Œ  9853972  9762546  9631482  9904312           2.83
ë¶€ì‚°  ê²½ìƒê¶Œ  3655437  3512547  3393191  3448737           1.63
ì¸ì²œ  ìˆ˜ë„ê¶Œ  2466338  2517680  2632035  2890451           9.82
ëŒ€êµ¬  ê²½ìƒê¶Œ  2473990  2456016  2000002  2466052           1.41

ì—´ì„ ìš°ì„ ì ìœ¼ë¡œ ì²˜ë¦¬í•˜ëŠ” DataFrameì€ ì¼ë°˜ì ìœ¼ë¡œëŠ” í–‰ ì¶”ê°€ê°€ ì–´ë µë‹¤.<br>
ë”°ë¼ì„œ ì¸ë±ì„œë¥¼ ì´ìš©í•´ í–‰ì„ ì¶”ê°€í•  ìˆ˜ ìˆë‹¤.

In [53]:
df1.loc['ê´‘ì£¼'] = ['í˜¸ë‚¨ê¶Œ', 2470000, 2456000, 2453000, 2460000, 1.00]
df1

íŠ¹ì„±   ì§€ì—­     2000     2005     2010     2015  2010-2015 ì¦ê°€ìœ¨
ë„ì‹œ
ì„œìš¸  ìˆ˜ë„ê¶Œ  9853972  9762546  9631482  9904312           2.83
ë¶€ì‚°  ê²½ìƒê¶Œ  3655437  3512547  3393191  3448737           1.63
ì¸ì²œ  ìˆ˜ë„ê¶Œ  2466338  2517680  2632035  2890451           9.82
ëŒ€êµ¬  ê²½ìƒê¶Œ  2473990  2456016  2000002  2466052           1.41
ê´‘ì£¼  í˜¸ë‚¨ê¶Œ  2470000  2456000  2453000  2460000           1.00

drop() í•¨ìˆ˜ë¥¼ ì‚¬ìš©í•´ í–‰ê³¼ ì—´ì„ ì‚­ì œí•  ìˆ˜ ìˆìœ¼ë©° ê·¸ ë°©ë²•ì€ ë‹¤ìŒê³¼ ê°™ë‹¤.

**drop(index=ì‚­ì œí•  ì¸ë±ìŠ¤ ë¦¬ìŠ¤íŠ¸)**<br>
**drop(columns=ì‚­ì œí•  ì»¬ëŸ¼ ë¦¬ìŠ¤íŠ¸)**<br>
**drop(ì‚­ì œí•  ì¸ë±ìŠ¤ ë˜ëŠ” ì»¬ëŸ¼ ë¦¬ìŠ¤íŠ¸ [, axis=0 or 1] [, inplace=True or False])**

In [54]:
df1

íŠ¹ì„±   ì§€ì—­     2000     2005     2010     2015  2010-2015 ì¦ê°€ìœ¨
ë„ì‹œ
ì„œìš¸  ìˆ˜ë„ê¶Œ  9853972  9762546  9631482  9904312           2.83
ë¶€ì‚°  ê²½ìƒê¶Œ  3655437  3512547  3393191  3448737           1.63
ì¸ì²œ  ìˆ˜ë„ê¶Œ  2466338  2517680  2632035  2890451           9.82
ëŒ€êµ¬  ê²½ìƒê¶Œ  2473990  2456016  2000002  2466052           1.41
ê´‘ì£¼  í˜¸ë‚¨ê¶Œ  2470000  2456000  2453000  2460000           1.00

In [55]:
df1.drop(index=['ê´‘ì£¼'])

íŠ¹ì„±   ì§€ì—­     2000     2005     2010     2015  2010-2015 ì¦ê°€ìœ¨
ë„ì‹œ
ì„œìš¸  ìˆ˜ë„ê¶Œ  9853972  9762546  9631482  9904312           2.83
ë¶€ì‚°  ê²½ìƒê¶Œ  3655437  3512547  3393191  3448737           1.63
ì¸ì²œ  ìˆ˜ë„ê¶Œ  2466338  2517680  2632035  2890451           9.82
ëŒ€êµ¬  ê²½ìƒê¶Œ  2473990  2456016  2000002  2466052           1.41

In [56]:
df1

íŠ¹ì„±   ì§€ì—­     2000     2005     2010     2015  2010-2015 ì¦ê°€ìœ¨
ë„ì‹œ
ì„œìš¸  ìˆ˜ë„ê¶Œ  9853972  9762546  9631482  9904312           2.83
ë¶€ì‚°  ê²½ìƒê¶Œ  3655437  3512547  3393191  3448737           1.63
ì¸ì²œ  ìˆ˜ë„ê¶Œ  2466338  2517680  2632035  2890451           9.82
ëŒ€êµ¬  ê²½ìƒê¶Œ  2473990  2456016  2000002  2466052           1.41
ê´‘ì£¼  í˜¸ë‚¨ê¶Œ  2470000  2456000  2453000  2460000           1.00

inplace íŒŒë¼ë¯¸í„°ëŠ” ë””í´íŠ¸ ê°’ì´ Falseì´ë©° drop() í•¨ìˆ˜ì˜ ìˆ˜í–‰ ë‚´ìš©ì´ ì›ë³¸ì— ë°˜ì˜ë˜ì§€ ì•ŠëŠ”ë‹¤.<br>
inplace íŒŒë¼ë¯¸í„°ê°€ Trueë¼ë©´ drop() í•¨ìˆ˜ì˜ ìˆ˜í–‰ ë‚´ìš©ì´ ì›ë³¸ì— ë°˜ì˜ëœë‹¤.

In [57]:
df1.drop(index=['ê´‘ì£¼'], inplace=True)

In [58]:
df1

íŠ¹ì„±   ì§€ì—­     2000     2005     2010     2015  2010-2015 ì¦ê°€ìœ¨
ë„ì‹œ
ì„œìš¸  ìˆ˜ë„ê¶Œ  9853972  9762546  9631482  9904312           2.83
ë¶€ì‚°  ê²½ìƒê¶Œ  3655437  3512547  3393191  3448737           1.63
ì¸ì²œ  ìˆ˜ë„ê¶Œ  2466338  2517680  2632035  2890451           9.82
ëŒ€êµ¬  ê²½ìƒê¶Œ  2473990  2456016  2000002  2466052           1.41

In [59]:
df1.drop(columns=['2010', '2015', '2010-2015 ì¦ê°€ìœ¨'])

íŠ¹ì„±   ì§€ì—­     2000     2005
ë„ì‹œ
ì„œìš¸  ìˆ˜ë„ê¶Œ  9853972  9762546
ë¶€ì‚°  ê²½ìƒê¶Œ  3655437  3512547
ì¸ì²œ  ìˆ˜ë„ê¶Œ  2466338  2517680
ëŒ€êµ¬  ê²½ìƒê¶Œ  2473990  2456016

In [60]:
df1

íŠ¹ì„±   ì§€ì—­     2000     2005     2010     2015  2010-2015 ì¦ê°€ìœ¨
ë„ì‹œ
ì„œìš¸  ìˆ˜ë„ê¶Œ  9853972  9762546  9631482  9904312           2.83
ë¶€ì‚°  ê²½ìƒê¶Œ  3655437  3512547  3393191  3448737           1.63
ì¸ì²œ  ìˆ˜ë„ê¶Œ  2466338  2517680  2632035  2890451           9.82
ëŒ€êµ¬  ê²½ìƒê¶Œ  2473990  2456016  2000002  2466052           1.41

axis íŒŒë¼ë¯¸í„°ëŠ” ë””í´íŠ¸ ê°’ì´ 0ì´ë©° í–‰ì„ ì‚­ì œí•œë‹¤.<br>
axis íŒŒë¼ë¯¸í„°ê°€ 1ì´ë¼ë©´ ì—´ì„ ì‚­ì œí•œë‹¤.

In [61]:
df1.drop(['ì¸ì²œ', 'ëŒ€êµ¬'], axis=0)

íŠ¹ì„±   ì§€ì—­     2000     2005     2010     2015  2010-2015 ì¦ê°€ìœ¨
ë„ì‹œ
ì„œìš¸  ìˆ˜ë„ê¶Œ  9853972  9762546  9631482  9904312           2.83
ë¶€ì‚°  ê²½ìƒê¶Œ  3655437  3512547  3393191  3448737           1.63

In [62]:
df1.drop(['2000', '2010'], axis=1)

íŠ¹ì„±   ì§€ì—­     2005     2015  2010-2015 ì¦ê°€ìœ¨
ë„ì‹œ
ì„œìš¸  ìˆ˜ë„ê¶Œ  9762546  9904312           2.83
ë¶€ì‚°  ê²½ìƒê¶Œ  3512547  3448737           1.63
ì¸ì²œ  ìˆ˜ë„ê¶Œ  2517680  2890451           9.82
ëŒ€êµ¬  ê²½ìƒê¶Œ  2456016  2466052           1.41